===================================================================================================
Numbers
===================================================================================================

function test() {
    123;
    -2137;
    923762112;
    567.8;
    0.;
    9.f;
    0.0000001;
    .10;
    .0f;
}

---------------------------------------------------------------------------------------------------

(script
  (global_func_decl_stmt
    name: (ident)
    definition: (func_block
        (expr_stmt
            (literal_int))
        (expr_stmt
            (literal_int))
        (expr_stmt
            (literal_int))
        (expr_stmt
            (literal_float))
        (expr_stmt
            (literal_float))
        (expr_stmt
            (literal_float))
        (expr_stmt
            (literal_float))
        (expr_stmt
            (literal_float))
        (expr_stmt
            (literal_float)))))





===================================================================================================
NULL
===================================================================================================

function test() {
    NULL;
}

---------------------------------------------------------------------------------------------------

(script
  (global_func_decl_stmt
    name: (ident)
    definition: (func_block
        (expr_stmt
            (literal_null)))))





===================================================================================================
bool
===================================================================================================

function test() {
    true;
    false;
}

---------------------------------------------------------------------------------------------------

(script
  (global_func_decl_stmt
    name: (ident)
    definition: (func_block
        (expr_stmt
            (literal_bool))
        (expr_stmt
            (literal_bool)))))





===================================================================================================
string-likes
===================================================================================================

function test() {
    "abrakadabra";
    "String with \"escaped quotes\"";
    '_alakazam123';
}

---------------------------------------------------------------------------------------------------

(script
  (global_func_decl_stmt
    name: (ident)
    definition: (func_block
        (expr_stmt
            (literal_string))
        (expr_stmt
            (literal_string))
        (expr_stmt
            (literal_name)))))