===================================================================================================
Numbers
===================================================================================================

function test() {
    123;
    -2137;
    923762112;
    567.8;
    9.f;
    0.0000001;
}

---------------------------------------------------------------------------------------------------

(script
  (func_decl_stmt
    name: (ident)
    definition: (func_block
        (expr_stmt
          (literal
            (literal_int)))
        (expr_stmt
          (literal
            (literal_int)))
        (expr_stmt
          (literal
            (literal_int)))
        (expr_stmt
          (literal
            (literal_float)))
        (expr_stmt
          (literal
            (literal_float)))
        (expr_stmt
          (literal
            (literal_float))))))





===================================================================================================
NULL
===================================================================================================

function test() {
    NULL;
}

---------------------------------------------------------------------------------------------------

(script
  (func_decl_stmt
    name: (ident)
    definition: (func_block
        (expr_stmt
          (literal
            (literal_null))))))





===================================================================================================
bool
===================================================================================================

function test() {
    true;
    false;
}

---------------------------------------------------------------------------------------------------

(script
  (func_decl_stmt
    name: (ident)
    definition: (func_block
        (expr_stmt
          (literal
            (literal_bool)))
        (expr_stmt
          (literal
            (literal_bool))))))





===================================================================================================
string-likes
===================================================================================================

function test() {
    "abrakadabra";
    "String with \"escaped quotes\"";
    '_alakazam123';
}

---------------------------------------------------------------------------------------------------

(script
  (func_decl_stmt
    name: (ident)
    definition: (func_block
        (expr_stmt
          (literal
            (literal_string)))
        (expr_stmt
          (literal
            (literal_string)))
        (expr_stmt
          (literal
            (literal_name))))))